Revit 2027 API
ExportLinetypeTable.GetLinetypeTableIterator Method
Returns a ExportLinetypeTableIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLinetypeTableIterator GetLinetypeTableIterator()
Public Function GetLinetypeTableIterator As ExportLinetypeTableIterator
public:
ExportLinetypeTableIterator^ GetLinetypeTableIterator()
member GetLinetypeTableIterator : unit -> ExportLinetypeTableIterator
Return Value
ExportLinetypeTableIterator
A ExportLinetypeTableIterator object that can be used to iterate through key-value pairs in the collection.
See Also
Reference
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace